zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_hci_le.c
/**
  ******************************************************************************
  * @file    stm32wb07_06_hci_le.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Source file for external uC - stm32wb07_06 in network coprocessor
  *          mode (hci_le). Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "ble_types.h"
#include "stm32wb07_06_hci_le.h"
#include "hci_tl.h"

ble_status_t hci_disconnect(uint16_t connection_handle,
                            uint8_t reason)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_disconnect_cp0 *cp0 = (hci_disconnect_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->reason = HTOB(reason, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x01;
  rq_t.ocf = 0x006;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_remote_version_information(uint16_t connection_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_read_remote_version_information_cp0 *cp0 = (hci_read_remote_version_information_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x01;
  rq_t.ocf = 0x01d;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_set_event_mask(uint8_t event_mask[8])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_set_event_mask_cp0 *cp0 = (hci_set_event_mask_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->event_mask, (const void *) event_mask, 8);
  index_input += 8;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x03;
  rq_t.ocf = 0x001;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_reset(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x03;
  rq_t.ocf = 0x003;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_transmit_power_level(uint16_t connection_handle,
                                           uint8_t type,
                                           int8_t *transmit_power_level)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_read_transmit_power_level_cp0 *cp0 = (hci_read_transmit_power_level_cp0 *)(cmd_buffer);
  hci_read_transmit_power_level_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->type = HTOB(type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x03;
  rq_t.ocf = 0x02d;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *transmit_power_level = BTOH(resp.transmit_power_level, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_set_event_mask_page_2(uint8_t event_mask_page_2[8])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_set_event_mask_page_2_cp0 *cp0 = (hci_set_event_mask_page_2_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->event_mask_page_2, (const void *) event_mask_page_2, 8);
  index_input += 8;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x03;
  rq_t.ocf = 0x063;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_authenticated_payload_timeout(uint16_t connection_handle,
                                                    uint16_t *authenticated_payload_timeout)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_read_authenticated_payload_timeout_cp0 *cp0 = (hci_read_authenticated_payload_timeout_cp0 *)(cmd_buffer);
  hci_read_authenticated_payload_timeout_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x03;
  rq_t.ocf = 0x07b;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *authenticated_payload_timeout = BTOH(resp.authenticated_payload_timeout, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_write_authenticated_payload_timeout(uint16_t connection_handle,
                                                     uint16_t authenticated_payload_timeout)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_write_authenticated_payload_timeout_cp0 *cp0 = (hci_write_authenticated_payload_timeout_cp0 *)(cmd_buffer);
  hci_write_authenticated_payload_timeout_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->authenticated_payload_timeout = HTOB(authenticated_payload_timeout, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x03;
  rq_t.ocf = 0x07c;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_local_version_information(uint8_t *hci_version,
                                                uint16_t *hci_revision,
                                                uint8_t *lmp_pal_version,
                                                uint16_t *manufacturer_name,
                                                uint16_t *lmp_pal_subversion)
{
  struct hci_request rq_t;
  hci_read_local_version_information_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x04;
  rq_t.ocf = 0x001;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *hci_version = BTOH(resp.hci_version, 1);
  *hci_revision = BTOH(resp.hci_revision, 2);
  *lmp_pal_version = BTOH(resp.lmp_pal_version, 1);
  *manufacturer_name = BTOH(resp.manufacturer_name, 2);
  *lmp_pal_subversion = BTOH(resp.lmp_pal_subversion, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_local_supported_commands(uint8_t supported_commands[64])
{
  struct hci_request rq_t;
  hci_read_local_supported_commands_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x04;
  rq_t.ocf = 0x002;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) supported_commands, (const void *) resp.supported_commands, 64);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_local_supported_features(uint8_t lmp_features[8])
{
  struct hci_request rq_t;
  hci_read_local_supported_features_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x04;
  rq_t.ocf = 0x003;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) lmp_features, (const void *) resp.lmp_features, 8);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_bd_addr(uint8_t bd_addr[6])
{
  struct hci_request rq_t;
  hci_read_bd_addr_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x04;
  rq_t.ocf = 0x009;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) bd_addr, (const void *) resp.bd_addr, 6);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_read_rssi(uint16_t connection_handle,
                           int8_t *rssi)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_read_rssi_cp0 *cp0 = (hci_read_rssi_cp0 *)(cmd_buffer);
  hci_read_rssi_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x05;
  rq_t.ocf = 0x005;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *rssi = BTOH(resp.rssi, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_event_mask(uint8_t le_event_mask[8])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_event_mask_cp0 *cp0 = (hci_le_set_event_mask_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->le_event_mask, (const void *) le_event_mask, 8);
  index_input += 8;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x001;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_buffer_size(uint16_t *hc_le_acl_data_packet_length,
                                     uint8_t *hc_total_num_le_acl_data_lackets)
{
  struct hci_request rq_t;
  hci_le_read_buffer_size_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x002;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *hc_le_acl_data_packet_length = BTOH(resp.hc_le_acl_data_packet_length, 2);
  *hc_total_num_le_acl_data_lackets = BTOH(resp.hc_total_num_le_acl_data_lackets, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_local_supported_features(uint8_t le_features[8])
{
  struct hci_request rq_t;
  hci_le_read_local_supported_features_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x003;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) le_features, (const void *) resp.le_features, 8);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_random_address(uint8_t random_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_random_address_cp0 *cp0 = (hci_le_set_random_address_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->random_address, (const void *) random_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x005;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_advertising_parameters(uint16_t advertising_interval_min,
                                               uint16_t advertising_interval_max,
                                               uint8_t advertising_type,
                                               uint8_t own_address_type,
                                               uint8_t peer_address_type,
                                               uint8_t peer_address[6],
                                               uint8_t advertising_channel_map,
                                               uint8_t advertising_filter_policy)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_advertising_parameters_cp0 *cp0 = (hci_le_set_advertising_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_interval_min = HTOB(advertising_interval_min, 2);
  index_input += 2;
  cp0->advertising_interval_max = HTOB(advertising_interval_max, 2);
  index_input += 2;
  cp0->advertising_type = HTOB(advertising_type, 1);
  index_input += 1;
  cp0->own_address_type = HTOB(own_address_type, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  if (peer_address)
  {
    STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  }
  index_input += 6;
  cp0->advertising_channel_map = HTOB(advertising_channel_map, 1);
  index_input += 1;
  cp0->advertising_filter_policy = HTOB(advertising_filter_policy, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x006;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_advertising_channel_tx_power(int8_t *transmit_power_level)
{
  struct hci_request rq_t;
  hci_le_read_advertising_channel_tx_power_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x007;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *transmit_power_level = BTOH(resp.transmit_power_level, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_advertising_data(uint8_t advertising_data_length,
                                         uint8_t advertising_data[31])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_advertising_data_cp0 *cp0 = (hci_le_set_advertising_data_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_data_length = HTOB(advertising_data_length, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_data, (const void *) advertising_data, 31);
  index_input += 31;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x008;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_scan_response_data(uint8_t scan_response_data_length,
                                           uint8_t scan_response_data[31])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_scan_response_data_cp0 *cp0 = (hci_le_set_scan_response_data_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->scan_response_data_length = HTOB(scan_response_data_length, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->scan_response_data, (const void *) scan_response_data, 31);
  index_input += 31;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x009;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_advertising_enable(uint8_t advertising_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_advertising_enable_cp0 *cp0 = (hci_le_set_advertising_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_enable = HTOB(advertising_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x00a;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_scan_parameters(uint8_t le_scan_type,
                                        uint16_t le_scan_interval,
                                        uint16_t le_scan_window,
                                        uint8_t own_address_type,
                                        uint8_t scanning_filter_policy)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_scan_parameters_cp0 *cp0 = (hci_le_set_scan_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->le_scan_type = HTOB(le_scan_type, 1);
  index_input += 1;
  cp0->le_scan_interval = HTOB(le_scan_interval, 2);
  index_input += 2;
  cp0->le_scan_window = HTOB(le_scan_window, 2);
  index_input += 2;
  cp0->own_address_type = HTOB(own_address_type, 1);
  index_input += 1;
  cp0->scanning_filter_policy = HTOB(scanning_filter_policy, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x00b;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_scan_enable(uint8_t le_scan_enable,
                                    uint8_t filter_duplicates)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_scan_enable_cp0 *cp0 = (hci_le_set_scan_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->le_scan_enable = HTOB(le_scan_enable, 1);
  index_input += 1;
  cp0->filter_duplicates = HTOB(filter_duplicates, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x00c;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_create_connection(uint16_t le_scan_interval,
                                      uint16_t le_scan_window,
                                      uint8_t initiator_filter_policy,
                                      uint8_t peer_address_type,
                                      uint8_t peer_address[6],
                                      uint8_t own_address_type,
                                      uint16_t conn_interval_min,
                                      uint16_t conn_interval_max,
                                      uint16_t conn_latency,
                                      uint16_t supervision_timeout,
                                      uint16_t minimum_ce_length,
                                      uint16_t maximum_ce_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_create_connection_cp0 *cp0 = (hci_le_create_connection_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->le_scan_interval = HTOB(le_scan_interval, 2);
  index_input += 2;
  cp0->le_scan_window = HTOB(le_scan_window, 2);
  index_input += 2;
  cp0->initiator_filter_policy = HTOB(initiator_filter_policy, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  index_input += 6;
  cp0->own_address_type = HTOB(own_address_type, 1);
  index_input += 1;
  cp0->conn_interval_min = HTOB(conn_interval_min, 2);
  index_input += 2;
  cp0->conn_interval_max = HTOB(conn_interval_max, 2);
  index_input += 2;
  cp0->conn_latency = HTOB(conn_latency, 2);
  index_input += 2;
  cp0->supervision_timeout = HTOB(supervision_timeout, 2);
  index_input += 2;
  cp0->minimum_ce_length = HTOB(minimum_ce_length, 2);
  index_input += 2;
  cp0->maximum_ce_length = HTOB(maximum_ce_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x00d;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_create_connection_cancel(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x00e;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_white_list_size(uint8_t *white_list_size)
{
  struct hci_request rq_t;
  hci_le_read_white_list_size_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x00f;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *white_list_size = BTOH(resp.white_list_size, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_clear_white_list(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x010;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_add_device_to_white_list(uint8_t address_type,
