zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_hci_le.c
                                             uint8_t address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_add_device_to_white_list_cp0 *cp0 = (hci_le_add_device_to_white_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->address_type = HTOB(address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->address, (const void *) address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x011;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_remove_device_from_white_list(uint8_t address_type,
                                                  uint8_t address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_remove_device_from_white_list_cp0 *cp0 = (hci_le_remove_device_from_white_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->address_type = HTOB(address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->address, (const void *) address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x012;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_connection_update(uint16_t connection_handle,
                                      uint16_t conn_interval_min,
                                      uint16_t conn_interval_max,
                                      uint16_t conn_latency,
                                      uint16_t supervision_timeout,
                                      uint16_t minimum_ce_length,
                                      uint16_t maximum_ce_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_connection_update_cp0 *cp0 = (hci_le_connection_update_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->conn_interval_min = HTOB(conn_interval_min, 2);
  index_input += 2;
  cp0->conn_interval_max = HTOB(conn_interval_max, 2);
  index_input += 2;
  cp0->conn_latency = HTOB(conn_latency, 2);
  index_input += 2;
  cp0->supervision_timeout = HTOB(supervision_timeout, 2);
  index_input += 2;
  cp0->minimum_ce_length = HTOB(minimum_ce_length, 2);
  index_input += 2;
  cp0->maximum_ce_length = HTOB(maximum_ce_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x013;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_host_channel_classification(uint8_t le_channel_map[5])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_host_channel_classification_cp0 *cp0 = (hci_le_set_host_channel_classification_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->le_channel_map, (const void *) le_channel_map, 5);
  index_input += 5;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x014;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_channel_map(uint16_t connection_handle,
                                     uint8_t le_channel_map[5])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_read_channel_map_cp0 *cp0 = (hci_le_read_channel_map_cp0 *)(cmd_buffer);
  hci_le_read_channel_map_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x015;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) le_channel_map, (const void *) resp.le_channel_map, 5);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_remote_used_features(uint16_t connection_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_read_remote_used_features_cp0 *cp0 = (hci_le_read_remote_used_features_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x016;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_encrypt(uint8_t key[16],
                            uint8_t plaintext_data[16],
                            uint8_t encrypted_data[16])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_encrypt_cp0 *cp0 = (hci_le_encrypt_cp0 *)(cmd_buffer);
  hci_le_encrypt_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->key, (const void *) key, 16);
  index_input += 16;
  STM32WB07_06_MEMCPY((void *) &cp0->plaintext_data, (const void *) plaintext_data, 16);
  index_input += 16;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x017;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) encrypted_data, (const void *) resp.encrypted_data, 16);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_rand(uint8_t random_number[8])
{
  struct hci_request rq_t;
  hci_le_rand_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x018;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) random_number, (const void *) resp.random_number, 8);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_start_encryption(uint16_t connection_handle,
                                     uint8_t random_number[8],
                                     uint16_t encrypted_diversifier,
                                     uint8_t long_term_key[16])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_start_encryption_cp0 *cp0 = (hci_le_start_encryption_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMCPY((void *) &cp0->random_number, (const void *) random_number, 8);
  index_input += 8;
  cp0->encrypted_diversifier = HTOB(encrypted_diversifier, 2);
  index_input += 2;
  STM32WB07_06_MEMCPY((void *) &cp0->long_term_key, (const void *) long_term_key, 16);
  index_input += 16;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x019;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_long_term_key_request_reply(uint16_t connection_handle,
                                                uint8_t long_term_key[16])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_long_term_key_request_reply_cp0 *cp0 = (hci_le_long_term_key_request_reply_cp0 *)(cmd_buffer);
  hci_le_long_term_key_request_reply_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMCPY((void *) &cp0->long_term_key, (const void *) long_term_key, 16);
  index_input += 16;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x01a;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_long_term_key_requested_negative_reply(uint16_t connection_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_long_term_key_requested_negative_reply_cp0 *cp0 =
    (hci_le_long_term_key_requested_negative_reply_cp0 *)(cmd_buffer);
  hci_le_long_term_key_requested_negative_reply_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x01b;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_supported_states(uint8_t le_states[8])
{
  struct hci_request rq_t;
  hci_le_read_supported_states_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x01c;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) le_states, (const void *) resp.le_states, 8);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_receiver_test(uint8_t rx_frequency)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_receiver_test_cp0 *cp0 = (hci_le_receiver_test_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->rx_frequency = HTOB(rx_frequency, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x01d;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_transmitter_test(uint8_t tx_frequency,
                                     uint8_t length_of_test_data,
                                     uint8_t packet_payload)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_transmitter_test_cp0 *cp0 = (hci_le_transmitter_test_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->tx_frequency = HTOB(tx_frequency, 1);
  index_input += 1;
  cp0->length_of_test_data = HTOB(length_of_test_data, 1);
  index_input += 1;
  cp0->packet_payload = HTOB(packet_payload, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x01e;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_test_end(uint16_t *number_of_packets)
{
  struct hci_request rq_t;
  hci_le_test_end_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x01f;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *number_of_packets = BTOH(resp.number_of_packets, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_data_length(uint16_t connection_handle,
                                    uint16_t tx_octets,
                                    uint16_t tx_time)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_data_length_cp0 *cp0 = (hci_le_set_data_length_cp0 *)(cmd_buffer);
  hci_le_set_data_length_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->tx_octets = HTOB(tx_octets, 2);
  index_input += 2;
  cp0->tx_time = HTOB(tx_time, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x022;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_suggested_default_data_length(uint16_t *suggested_max_tx_octets,
                                                       uint16_t *suggested_max_tx_time)
{
  struct hci_request rq_t;
  hci_le_read_suggested_default_data_length_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x023;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *suggested_max_tx_octets = BTOH(resp.suggested_max_tx_octets, 2);
  *suggested_max_tx_time = BTOH(resp.suggested_max_tx_time, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_write_suggested_default_data_length(uint16_t suggested_max_tx_octets,
                                                        uint16_t suggested_max_tx_time)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_write_suggested_default_data_length_cp0 *cp0 = (hci_le_write_suggested_default_data_length_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->suggested_max_tx_octets = HTOB(suggested_max_tx_octets, 2);
  index_input += 2;
  cp0->suggested_max_tx_time = HTOB(suggested_max_tx_time, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x024;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_local_p256_public_key(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x025;
  rq_t.event = 0x0F;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_generate_dhkey(uint8_t remote_p256_public_key[64])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_generate_dhkey_cp0 *cp0 = (hci_le_generate_dhkey_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->remote_p256_public_key, (const void *) remote_p256_public_key, 64);
  index_input += 64;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x026;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_add_device_to_resolving_list(uint8_t peer_identity_address_type,
                                                 uint8_t peer_identity_address[6],
                                                 uint8_t peer_irk[16],
                                                 uint8_t local_irk[16])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_add_device_to_resolving_list_cp0 *cp0 = (hci_le_add_device_to_resolving_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->peer_identity_address_type = HTOB(peer_identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_identity_address, (const void *) peer_identity_address, 6);
  index_input += 6;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_irk, (const void *) peer_irk, 16);
  index_input += 16;
  STM32WB07_06_MEMCPY((void *) &cp0->local_irk, (const void *) local_irk, 16);
  index_input += 16;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x027;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_remove_device_from_resolving_list(uint8_t peer_identity_address_type,
                                                      uint8_t peer_identity_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_remove_device_from_resolving_list_cp0 *cp0 = (hci_le_remove_device_from_resolving_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->peer_identity_address_type = HTOB(peer_identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_identity_address, (const void *) peer_identity_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x028;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_clear_resolving_list(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x029;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_resolving_list_size(uint8_t *resolving_list_size)
{
  struct hci_request rq_t;
  hci_le_read_resolving_list_size_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x02a;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *resolving_list_size = BTOH(resp.resolving_list_size, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_peer_resolvable_address(uint8_t peer_identity_address_type,
                                                 uint8_t peer_identity_address[6],
                                                 uint8_t peer_resolvable_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_read_peer_resolvable_address_cp0 *cp0 = (hci_le_read_peer_resolvable_address_cp0 *)(cmd_buffer);
  hci_le_read_peer_resolvable_address_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->peer_identity_address_type = HTOB(peer_identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_identity_address, (const void *) peer_identity_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x02b;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) peer_resolvable_address, (const void *) resp.peer_resolvable_address, 6);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_local_resolvable_address(uint8_t peer_identity_address_type,
                                                  uint8_t peer_identity_address[6],
                                                  uint8_t local_resolvable_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_read_local_resolvable_address_cp0 *cp0 = (hci_le_read_local_resolvable_address_cp0 *)(cmd_buffer);
  hci_le_read_local_resolvable_address_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->peer_identity_address_type = HTOB(peer_identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_identity_address, (const void *) peer_identity_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x02c;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) local_resolvable_address, (const void *) resp.local_resolvable_address, 6);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_address_resolution_enable(uint8_t address_resolution_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_address_resolution_enable_cp0 *cp0 = (hci_le_set_address_resolution_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->address_resolution_enable = HTOB(address_resolution_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x02d;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_resolvable_private_address_timeout(uint16_t rpa_timeout)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_resolvable_private_address_timeout_cp0 *cp0 =
    (hci_le_set_resolvable_private_address_timeout_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->rpa_timeout = HTOB(rpa_timeout, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x02e;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_maximum_data_length(uint16_t *supported_max_tx_octets,
                                             uint16_t *supported_max_tx_time,
                                             uint16_t *supported_max_rx_octets,
                                             uint16_t *supported_max_rx_time)
{
  struct hci_request rq_t;
  hci_le_read_maximum_data_length_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
