zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_hci_le.c
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x02f;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *supported_max_tx_octets = BTOH(resp.supported_max_tx_octets, 2);
  *supported_max_tx_time = BTOH(resp.supported_max_tx_time, 2);
  *supported_max_rx_octets = BTOH(resp.supported_max_rx_octets, 2);
  *supported_max_rx_time = BTOH(resp.supported_max_rx_time, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_phy(uint16_t connection_handle,
                             uint8_t *tx_phy,
                             uint8_t *rx_phy)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_read_phy_cp0 *cp0 = (hci_le_read_phy_cp0 *)(cmd_buffer);
  hci_le_read_phy_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x030;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *tx_phy = BTOH(resp.tx_phy, 1);
  *rx_phy = BTOH(resp.rx_phy, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_default_phy(uint8_t all_phys,
                                    uint8_t tx_phys,
                                    uint8_t rx_phys)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_default_phy_cp0 *cp0 = (hci_le_set_default_phy_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->all_phys = HTOB(all_phys, 1);
  index_input += 1;
  cp0->tx_phys = HTOB(tx_phys, 1);
  index_input += 1;
  cp0->rx_phys = HTOB(rx_phys, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x031;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_phy(uint16_t connection_handle,
                            uint8_t all_phys,
                            uint8_t tx_phys,
                            uint8_t rx_phys,
                            uint16_t phy_options)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_phy_cp0 *cp0 = (hci_le_set_phy_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->all_phys = HTOB(all_phys, 1);
  index_input += 1;
  cp0->tx_phys = HTOB(tx_phys, 1);
  index_input += 1;
  cp0->rx_phys = HTOB(rx_phys, 1);
  index_input += 1;
  cp0->phy_options = HTOB(phy_options, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x032;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_enhanced_receiver_test(uint8_t rx_channel,
                                           uint8_t phy,
                                           uint8_t modulation_index)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_enhanced_receiver_test_cp0 *cp0 = (hci_le_enhanced_receiver_test_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->rx_channel = HTOB(rx_channel, 1);
  index_input += 1;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  cp0->modulation_index = HTOB(modulation_index, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x033;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_enhanced_transmitter_test(uint8_t tx_channel,
                                              uint8_t length_of_test_data,
                                              uint8_t packet_payload,
                                              uint8_t phy)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_enhanced_transmitter_test_cp0 *cp0 = (hci_le_enhanced_transmitter_test_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->tx_channel = HTOB(tx_channel, 1);
  index_input += 1;
  cp0->length_of_test_data = HTOB(length_of_test_data, 1);
  index_input += 1;
  cp0->packet_payload = HTOB(packet_payload, 1);
  index_input += 1;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x034;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_advertising_set_random_address(uint8_t advertising_handle,
                                                       uint8_t advertising_random_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_advertising_set_random_address_cp0 *cp0 = (hci_le_set_advertising_set_random_address_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_random_address, (const void *) advertising_random_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x035;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_extended_advertising_parameters(uint8_t advertising_handle,
                                                        uint16_t advertising_event_properties,
                                                        uint8_t primary_advertising_interval_min[3],
                                                        uint8_t primary_advertising_interval_max[3],
                                                        uint8_t primary_advertising_channel_map,
                                                        uint8_t own_address_type,
                                                        uint8_t peer_address_type,
                                                        uint8_t peer_address[6],
                                                        uint8_t advertising_filter_policy,
                                                        int8_t advertising_tx_power,
                                                        uint8_t primary_advertising_phy,
                                                        uint8_t secondary_advertising_max_skip,
                                                        uint8_t secondary_advertising_phy,
                                                        uint8_t advertising_sid,
                                                        uint8_t scan_request_notification_enable,
                                                        int8_t *selected_tx_power)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_extended_advertising_parameters_cp0 *cp0 = (hci_le_set_extended_advertising_parameters_cp0 *)(cmd_buffer);
  hci_le_set_extended_advertising_parameters_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->advertising_event_properties = HTOB(advertising_event_properties, 2);
  index_input += 2;
  STM32WB07_06_MEMCPY((void *) &cp0->primary_advertising_interval_min, (const void *) primary_advertising_interval_min, 3);
  index_input += 3;
  STM32WB07_06_MEMCPY((void *) &cp0->primary_advertising_interval_max, (const void *) primary_advertising_interval_max, 3);
  index_input += 3;
  cp0->primary_advertising_channel_map = HTOB(primary_advertising_channel_map, 1);
  index_input += 1;
  cp0->own_address_type = HTOB(own_address_type, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  if (peer_address)
  {
    STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  }
  index_input += 6;
  cp0->advertising_filter_policy = HTOB(advertising_filter_policy, 1);
  index_input += 1;
  cp0->advertising_tx_power = HTOB(advertising_tx_power, 1);
  index_input += 1;
  cp0->primary_advertising_phy = HTOB(primary_advertising_phy, 1);
  index_input += 1;
  cp0->secondary_advertising_max_skip = HTOB(secondary_advertising_max_skip, 1);
  index_input += 1;
  cp0->secondary_advertising_phy = HTOB(secondary_advertising_phy, 1);
  index_input += 1;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  cp0->scan_request_notification_enable = HTOB(scan_request_notification_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x036;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *selected_tx_power = BTOH(resp.selected_tx_power, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_extended_advertising_data(uint8_t advertising_handle,
                                                  uint8_t operation,
                                                  uint8_t fragment_preference,
                                                  uint8_t advertising_data_length,
                                                  uint8_t advertising_data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_extended_advertising_data_cp0 *cp0 = (hci_le_set_extended_advertising_data_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->operation = HTOB(operation, 1);
  index_input += 1;
  cp0->fragment_preference = HTOB(fragment_preference, 1);
  index_input += 1;
  cp0->advertising_data_length = HTOB(advertising_data_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->advertising_data,
                   (const void *) advertising_data,
                   advertising_data_length * sizeof(uint8_t));
    index_input += advertising_data_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x037;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_extended_scan_response_data(uint8_t advertising_handle,
                                                    uint8_t operation,
                                                    uint8_t fragment_preference,
                                                    uint8_t scan_response_data_length,
                                                    uint8_t scan_response_data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_extended_scan_response_data_cp0 *cp0 = (hci_le_set_extended_scan_response_data_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->operation = HTOB(operation, 1);
  index_input += 1;
  cp0->fragment_preference = HTOB(fragment_preference, 1);
  index_input += 1;
  cp0->scan_response_data_length = HTOB(scan_response_data_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->scan_response_data,
                   (const void *) scan_response_data,
                   scan_response_data_length * sizeof(uint8_t));
    index_input += scan_response_data_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x038;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_extended_advertising_enable(uint8_t enable,
                                                    uint8_t number_of_sets,
                                                    advertising_set_parameters_t advertising_set_parameters[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_extended_advertising_enable_cp0 *cp0 = (hci_le_set_extended_advertising_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  cp0->number_of_sets = HTOB(number_of_sets, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (uint32_t i = 0; i < number_of_sets; i++)
    {
      cp0->advertising_set_parameters[i].advertising_handle = advertising_set_parameters[i].advertising_handle;
      cp0->advertising_set_parameters[i].duration = advertising_set_parameters[i].duration;
      cp0->advertising_set_parameters[i].max_extended_advertising_events =
        advertising_set_parameters[i].max_extended_advertising_events;
    }
    index_input += number_of_sets * 4;
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x039;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_maximum_advertising_data_length(uint16_t *maximum_advertising_data_length)
{
  struct hci_request rq_t;
  hci_le_read_maximum_advertising_data_length_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x03a;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *maximum_advertising_data_length = BTOH(resp.maximum_advertising_data_length, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_number_of_supported_advertising_sets(uint8_t *num_supported_advertising_sets)
{
  struct hci_request rq_t;
  hci_le_read_number_of_supported_advertising_sets_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x03b;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *num_supported_advertising_sets = BTOH(resp.num_supported_advertising_sets, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_remove_advertising_set(uint8_t advertising_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_remove_advertising_set_cp0 *cp0 = (hci_le_remove_advertising_set_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x03c;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_clear_advertising_sets(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x03d;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_periodic_advertising_parameters(uint8_t advertising_handle,
                                                        uint16_t periodic_advertising_interval_min,
                                                        uint16_t periodic_advertising_interval_max,
                                                        uint16_t periodic_advertising_properties)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_parameters_cp0 *cp0 = (hci_le_set_periodic_advertising_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->periodic_advertising_interval_min = HTOB(periodic_advertising_interval_min, 2);
  index_input += 2;
  cp0->periodic_advertising_interval_max = HTOB(periodic_advertising_interval_max, 2);
  index_input += 2;
  cp0->periodic_advertising_properties = HTOB(periodic_advertising_properties, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x03e;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_periodic_advertising_data(uint8_t advertising_handle,
                                                  uint8_t operation,
                                                  uint8_t advertising_data_length,
                                                  uint8_t advertising_data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_periodic_advertising_data_cp0 *cp0 = (hci_le_set_periodic_advertising_data_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->operation = HTOB(operation, 1);
  index_input += 1;
  cp0->advertising_data_length = HTOB(advertising_data_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->advertising_data,
                   (const void *) advertising_data,
                   advertising_data_length * sizeof(uint8_t));
    index_input += advertising_data_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x03f;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_periodic_advertising_enable(uint8_t enable,
                                                    uint8_t advertising_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_enable_cp0 *cp0 = (hci_le_set_periodic_advertising_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x040;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_extended_scan_parameters(uint8_t own_address_type,
                                                 uint8_t scanning_filter_policy,
                                                 uint8_t scanning_phys,
                                                 extended_scan_parameters_t extended_scan_parameters[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_extended_scan_parameters_cp0 *cp0 = (hci_le_set_extended_scan_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->own_address_type = HTOB(own_address_type, 1);
  index_input += 1;
  cp0->scanning_filter_policy = HTOB(scanning_filter_policy, 1);
  index_input += 1;
  cp0->scanning_phys = HTOB(scanning_phys, 1);
  index_input += 1;
  uint32_t len = 0;

