zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_hci_le.c
  for (uint32_t i = 0; i < sizeof(cp0->scanning_phys) * 8; i++)
  {
    if ((cp0->scanning_phys >> i) & 0x01)
    {
      len++;
    }
  }
  /* var_len_data input */
  {
    for (uint32_t i = 0; i < len; i++)
    {
      cp0->extended_scan_parameters[i].scan_type = extended_scan_parameters[i].scan_type;
      cp0->extended_scan_parameters[i].scan_interval = extended_scan_parameters[i].scan_interval;
      cp0->extended_scan_parameters[i].scan_window = extended_scan_parameters[i].scan_window;
    }
    index_input += len * 5;
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x041;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_extended_scan_enable(uint8_t enable,
                                             uint8_t filter_duplicates,
                                             uint16_t duration,
                                             uint16_t period)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_extended_scan_enable_cp0 *cp0 = (hci_le_set_extended_scan_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  cp0->filter_duplicates = HTOB(filter_duplicates, 1);
  index_input += 1;
  cp0->duration = HTOB(duration, 2);
  index_input += 2;
  cp0->period = HTOB(period, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x042;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_extended_create_connection(uint8_t initiating_filter_policy,
                                               uint8_t own_address_type,
                                               uint8_t peer_address_type,
                                               uint8_t peer_address[6],
                                               uint8_t initiating_phys,
                                               extended_create_connection_parameters_t ext_create_conn_param[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_extended_create_connection_cp0 *cp0 = (hci_le_extended_create_connection_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->initiating_filter_policy = HTOB(initiating_filter_policy, 1);
  index_input += 1;
  cp0->own_address_type = HTOB(own_address_type, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  index_input += 6;
  cp0->initiating_phys = HTOB(initiating_phys, 1);
  index_input += 1;
  uint32_t len = 0;

  for (uint32_t i = 0; i < sizeof(cp0->initiating_phys) * 8; i++)
  {
    if ((cp0->initiating_phys >> i) & 0x01)
    {
      len++;
    }
  }
  /* var_len_data input */
  {
    for (uint32_t i = 0; i < len; i++)
    {
      cp0->ext_create_conn_param[i].scan_interval =
        ext_create_conn_param[i].scan_interval;
      cp0->ext_create_conn_param[i].scan_window =
        ext_create_conn_param[i].scan_window;
      cp0->ext_create_conn_param[i].conn_interval_min =
        ext_create_conn_param[i].conn_interval_min;
      cp0->ext_create_conn_param[i].conn_interval_max =
        ext_create_conn_param[i].conn_interval_max;
      cp0->ext_create_conn_param[i].conn_latency =
        ext_create_conn_param[i].conn_latency;
      cp0->ext_create_conn_param[i].supervision_timeout =
        ext_create_conn_param[i].supervision_timeout;
      cp0->ext_create_conn_param[i].minimum_ce_length =
        ext_create_conn_param[i].minimum_ce_length;
      cp0->ext_create_conn_param[i].maximum_ce_length =
        ext_create_conn_param[i].maximum_ce_length;
    }
    index_input += len * 16;
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x043;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_periodic_advertising_create_sync(uint8_t options,
                                                     uint8_t advertising_sid,
                                                     uint8_t advertising_address_type,
                                                     uint8_t advertising_address[6],
                                                     uint16_t skip,
                                                     uint16_t sync_timeout,
                                                     uint8_t sync_cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_create_sync_cp0 *cp0 = (hci_le_periodic_advertising_create_sync_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->options = HTOB(options, 1);
  index_input += 1;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  cp0->advertising_address_type = HTOB(advertising_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_address, (const void *) advertising_address, 6);
  index_input += 6;
  cp0->skip = HTOB(skip, 2);
  index_input += 2;
  cp0->sync_timeout = HTOB(sync_timeout, 2);
  index_input += 2;
  cp0->sync_cte_type = HTOB(sync_cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x044;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_periodic_advertising_create_sync_cancel(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x045;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_periodic_advertising_terminate_sync(uint16_t sync_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_terminate_sync_cp0 *cp0 = (hci_le_periodic_advertising_terminate_sync_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x046;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_add_device_to_periodic_advertiser_list(uint8_t advertiser_address_type,
                                                           uint8_t advertising_address[6],
                                                           uint8_t advertising_sid)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_add_device_to_periodic_advertiser_list_cp0 *cp0 =
    (hci_le_add_device_to_periodic_advertiser_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertiser_address_type = HTOB(advertiser_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_address, (const void *) advertising_address, 6);
  index_input += 6;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x047;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_remove_device_from_periodic_advertising_list(uint8_t advertiser_address_type,
                                                                 uint8_t advertising_address[6],
                                                                 uint8_t advertising_sid)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_remove_device_from_periodic_advertising_list_cp0 *cp0 =
    (hci_le_remove_device_from_periodic_advertising_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertiser_address_type = HTOB(advertiser_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_address, (const void *) advertising_address, 6);
  index_input += 6;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x048;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_clear_periodic_advertiser_list(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x049;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_periodic_advertiser_list_size(uint8_t *periodic_advertiser_list_size)
{
  struct hci_request rq_t;
  hci_le_read_periodic_advertiser_list_size_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x04a;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *periodic_advertiser_list_size = BTOH(resp.periodic_advertiser_list_size, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_transmit_power(int8_t *min_tx_power,
                                        int8_t *max_tx_power)
{
  struct hci_request rq_t;
  hci_le_read_transmit_power_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x04b;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *min_tx_power = BTOH(resp.min_tx_power, 1);
  *max_tx_power = BTOH(resp.max_tx_power, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_rf_path_compensation(int16_t *rf_tx_path_compensation_value,
                                              int16_t *rf_rx_path_compensation_value)
{
  struct hci_request rq_t;
  hci_le_read_rf_path_compensation_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x04c;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *rf_tx_path_compensation_value = BTOH(resp.rf_tx_path_compensation_value, 2);
  *rf_rx_path_compensation_value = BTOH(resp.rf_rx_path_compensation_value, 2);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_write_rf_path_compensation(int16_t rf_tx_path_compensation_value,
                                               int16_t rf_rx_path_compensation_value)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_write_rf_path_compensation_cp0 *cp0 = (hci_le_write_rf_path_compensation_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->rf_tx_path_compensation_value = HTOB(rf_tx_path_compensation_value, 2);
  index_input += 2;
  cp0->rf_rx_path_compensation_value = HTOB(rf_rx_path_compensation_value, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x04d;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_privacy_mode(uint8_t peer_identity_address_type,
                                     uint8_t peer_identity_address[6],
                                     uint8_t privacy_mode)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_privacy_mode_cp0 *cp0 = (hci_le_set_privacy_mode_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->peer_identity_address_type = HTOB(peer_identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_identity_address, (const void *) peer_identity_address, 6);
  index_input += 6;
  cp0->privacy_mode = HTOB(privacy_mode, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x04e;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_receiver_test_v3(uint8_t rx_channel,
                                     uint8_t phy,
                                     uint8_t modulation_index,
                                     uint8_t expected_cte_length,
                                     uint8_t expected_cte_type,
                                     uint8_t slot_durations,
                                     uint8_t switching_pattern_length,
                                     uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_receiver_test_v3_cp0 *cp0 = (hci_le_receiver_test_v3_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->rx_channel = HTOB(rx_channel, 1);
  index_input += 1;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  cp0->modulation_index = HTOB(modulation_index, 1);
  index_input += 1;
  cp0->expected_cte_length = HTOB(expected_cte_length, 1);
  index_input += 1;
  cp0->expected_cte_type = HTOB(expected_cte_type, 1);
  index_input += 1;
  cp0->slot_durations = HTOB(slot_durations, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x04f;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_transmitter_test_v3(uint8_t tx_channel,
                                        uint8_t test_data_length,
                                        uint8_t packet_payload,
                                        uint8_t phy,
                                        uint8_t cte_length,
                                        uint8_t cte_type,
                                        uint8_t switching_pattern_length,
                                        uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_transmitter_test_v3_cp0 *cp0 = (hci_le_transmitter_test_v3_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->tx_channel = HTOB(tx_channel, 1);
  index_input += 1;
  cp0->test_data_length = HTOB(test_data_length, 1);
  index_input += 1;
  cp0->packet_payload = HTOB(packet_payload, 1);
  index_input += 1;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  cp0->cte_length = HTOB(cte_length, 1);
  index_input += 1;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x050;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_connectionless_cte_transmit_parameters(uint8_t advertising_handle,
                                                               uint8_t cte_length,
                                                               uint8_t cte_type,
                                                               uint8_t cte_count,
                                                               uint8_t switching_pattern_length,
                                                               uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_connectionless_cte_transmit_parameters_cp0 *cp0 =
    (hci_le_set_connectionless_cte_transmit_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->cte_length = HTOB(cte_length, 1);
  index_input += 1;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  cp0->cte_count = HTOB(cte_count, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x051;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_connectionless_cte_transmit_enable(uint8_t advertising_handle,
                                                           uint8_t cte_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_connectionless_cte_transmit_enable_cp0 *cp0 =
    (hci_le_set_connectionless_cte_transmit_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->cte_enable = HTOB(cte_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x052;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_connectionless_iq_sampling_enable(uint16_t sync_handle,
                                                          uint8_t sampling_enable,
                                                          uint8_t slot_durations,
                                                          uint8_t max_sampled_cte_s,
                                                          uint8_t switching_pattern_length,
                                                          uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_connectionless_iq_sampling_enable_cp0 *cp0 =
    (hci_le_set_connectionless_iq_sampling_enable_cp0 *)(cmd_buffer);
  hci_le_set_connectionless_iq_sampling_enable_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  cp0->sampling_enable = HTOB(sampling_enable, 1);
  index_input += 1;
  cp0->slot_durations = HTOB(slot_durations, 1);
  index_input += 1;
  cp0->max_sampled_cte_s = HTOB(max_sampled_cte_s, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x053;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_connection_cte_receive_parameters(uint16_t connection_handle,
                                                          uint8_t sampling_enable,
                                                          uint8_t slot_durations,
                                                          uint8_t switching_pattern_length,
                                                          uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_connection_cte_receive_parameters_cp0 *cp0 =
    (hci_le_set_connection_cte_receive_parameters_cp0 *)(cmd_buffer);
  hci_le_set_connection_cte_receive_parameters_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->sampling_enable = HTOB(sampling_enable, 1);
  index_input += 1;
  cp0->slot_durations = HTOB(slot_durations, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x054;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_connection_cte_transmit_parameters(uint16_t connection_handle,
                                                           uint8_t cte_type,
                                                           uint8_t switching_pattern_length,
                                                           uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_set_connection_cte_transmit_parameters_cp0 *cp0 =
    (hci_le_set_connection_cte_transmit_parameters_cp0 *)(cmd_buffer);
  hci_le_set_connection_cte_transmit_parameters_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->cte_type = HTOB(cte_type, 1);
