zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_hci_le.c
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x055;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_connection_cte_request_enable(uint16_t connection_handle,
                                                  uint8_t enable,
                                                  uint16_t cte_request_interval,
                                                  uint8_t requested_cte_length,
                                                  uint8_t requested_cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_connection_cte_request_enable_cp0 *cp0 = (hci_le_connection_cte_request_enable_cp0 *)(cmd_buffer);
  hci_le_connection_cte_request_enable_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  cp0->cte_request_interval = HTOB(cte_request_interval, 2);
  index_input += 2;
  cp0->requested_cte_length = HTOB(requested_cte_length, 1);
  index_input += 1;
  cp0->requested_cte_type = HTOB(requested_cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x056;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_connection_cte_response_enable(uint16_t connection_handle,
                                                   uint8_t enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_connection_cte_response_enable_cp0 *cp0 = (hci_le_connection_cte_response_enable_cp0 *)(cmd_buffer);
  hci_le_connection_cte_response_enable_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x057;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_antenna_information(uint8_t *supported_switching_sampling_rates,
                                             uint8_t *num_antennae,
                                             uint8_t *max_switching_pattern_length,
                                             uint8_t *max_cte_length)
{
  struct hci_request rq_t;
  hci_le_read_antenna_information_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x058;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *supported_switching_sampling_rates = BTOH(resp.supported_switching_sampling_rates, 1);
  *num_antennae = BTOH(resp.num_antennae, 1);
  *max_switching_pattern_length = BTOH(resp.max_switching_pattern_length, 1);
  *max_cte_length = BTOH(resp.max_cte_length, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_periodic_advertising_receive_enable(uint16_t sync_handle,
                                                            uint8_t enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_receive_enable_cp0 *cp0 =
    (hci_le_set_periodic_advertising_receive_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x059;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_periodic_advertising_sync_transfer(uint16_t connection_handle,
                                                       uint16_t service_data,
                                                       uint16_t sync_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_sync_transfer_cp0 *cp0 = (hci_le_periodic_advertising_sync_transfer_cp0 *)(cmd_buffer);
  hci_le_periodic_advertising_sync_transfer_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->service_data = HTOB(service_data, 2);
  index_input += 2;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x05a;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_periodic_advertising_set_info_transfer(uint16_t connection_handle,
                                                           uint16_t service_data,
                                                           uint8_t advertising_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_set_info_transfer_cp0 *cp0 =
    (hci_le_periodic_advertising_set_info_transfer_cp0 *)(cmd_buffer);
  hci_le_periodic_advertising_set_info_transfer_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->service_data = HTOB(service_data, 2);
  index_input += 2;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x05b;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_periodic_advertising_sync_transfer_parameters(uint16_t connection_handle,
                                                                      uint8_t mode,
                                                                      uint16_t skip,
                                                                      uint16_t sync_timeout,
                                                                      uint8_t cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_sync_transfer_parameters_cp0 *cp0 =
    (hci_le_set_periodic_advertising_sync_transfer_parameters_cp0 *)(cmd_buffer);
  hci_le_set_periodic_advertising_sync_transfer_parameters_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->mode = HTOB(mode, 1);
  index_input += 1;
  cp0->skip = HTOB(skip, 2);
  index_input += 2;
  cp0->sync_timeout = HTOB(sync_timeout, 2);
  index_input += 2;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x05c;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_default_periodic_advertising_sync_transfer_parameters(uint8_t mode,
                                                                              uint16_t skip,
                                                                              uint16_t sync_timeout,
                                                                              uint8_t cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0 *cp0 =
    (hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->mode = HTOB(mode, 1);
  index_input += 1;
  cp0->skip = HTOB(skip, 2);
  index_input += 2;
  cp0->sync_timeout = HTOB(sync_timeout, 2);
  index_input += 2;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x05d;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_enhanced_read_transmit_power_level(uint16_t connection_handle,
                                                       uint8_t phy,
                                                       int8_t *current_transmit_power_level,
                                                       int8_t *max_transmit_power_level)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_enhanced_read_transmit_power_level_cp0 *cp0 = (hci_le_enhanced_read_transmit_power_level_cp0 *)(cmd_buffer);
  hci_le_enhanced_read_transmit_power_level_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x076;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *current_transmit_power_level = BTOH(resp.current_transmit_power_level, 1);
  *max_transmit_power_level = BTOH(resp.max_transmit_power_level, 1);
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_read_remote_transmit_power_level(uint16_t connection_handle,
                                                     uint8_t phy)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_read_remote_transmit_power_level_cp0 *cp0 = (hci_le_read_remote_transmit_power_level_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x077;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_path_loss_reporting_parameters(uint16_t connection_handle,
                                                       uint8_t high_threshold,
                                                       uint8_t high_hysteresis,
                                                       uint8_t low_threshold,
                                                       uint8_t low_hysteresis,
                                                       uint16_t min_time_spent)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_path_loss_reporting_parameters_cp0 *cp0 = (hci_le_set_path_loss_reporting_parameters_cp0 *)(cmd_buffer);
  hci_le_set_path_loss_reporting_parameters_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->high_threshold = HTOB(high_threshold, 1);
  index_input += 1;
  cp0->high_hysteresis = HTOB(high_hysteresis, 1);
  index_input += 1;
  cp0->low_threshold = HTOB(low_threshold, 1);
  index_input += 1;
  cp0->low_hysteresis = HTOB(low_hysteresis, 1);
  index_input += 1;
  cp0->min_time_spent = HTOB(min_time_spent, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x078;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_path_loss_reporting_enable(uint16_t connection_handle,
                                                   uint8_t enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_path_loss_reporting_enable_cp0 *cp0 = (hci_le_set_path_loss_reporting_enable_cp0 *)(cmd_buffer);
  hci_le_set_path_loss_reporting_enable_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x079;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_set_transmit_power_reporting_enable(uint16_t connection_handle,
                                                        uint8_t local_enable,
                                                        uint8_t remote_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[258];
  hci_le_set_transmit_power_reporting_enable_cp0 *cp0 = (hci_le_set_transmit_power_reporting_enable_cp0 *)(cmd_buffer);
  hci_le_set_transmit_power_reporting_enable_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->local_enable = HTOB(local_enable, 1);
  index_input += 1;
  cp0->remote_enable = HTOB(remote_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x07a;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t hci_le_transmitter_test_v4(uint8_t tx_channel,
                                        uint8_t test_data_length,
                                        uint8_t packet_payload,
                                        uint8_t phy,
                                        uint8_t cte_length,
                                        uint8_t cte_type,
                                        uint8_t switching_pattern_length,
                                        uint8_t antenna_ids[],
                                        int8_t transmit_power_level)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[300];
  hci_le_transmitter_test_v4_cp0 *cp0 = (hci_le_transmitter_test_v4_cp0 *)(cmd_buffer);
  hci_le_transmitter_test_v4_cp1 *cp1 =
    (hci_le_transmitter_test_v4_cp1 *)(cmd_buffer +
                                       1 +
                                       1 +
                                       1 +
                                       1 +
                                       1 +
                                       1 +
                                       1 +
                                       switching_pattern_length * (sizeof(uint8_t)));
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->tx_channel = HTOB(tx_channel, 1);
  index_input += 1;
  cp0->test_data_length = HTOB(test_data_length, 1);
  index_input += 1;
  cp0->packet_payload = HTOB(packet_payload, 1);
  index_input += 1;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  cp0->cte_length = HTOB(cte_length, 1);
  index_input += 1;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
    {
      cp1->transmit_power_level = HTOB(transmit_power_level, 1);
    }
    index_input += 1;
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ogf = 0x08;
  rq_t.ocf = 0x07b;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
